#include "Map.h"
#include <d3d11.h>
#include <SimpleMath.h>

using namespace DirectX::SimpleMath;

using namespace std;

Map::Map() : _Child(nullptr)
{

}

Map::~Map()
{

}

void Map::Initialize()
{

	//地形を指定
	int landMap[MAP_SIZE_Y][MAP_SIZE_X] = {
		{ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
		{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1 },
		{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1 },
		{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1 },
		{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1 },
		{ 1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,1 },
		{ 1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1 },
		{ 1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1 },
		{ 1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1 },
		{ 1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,1 },
		{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1 },
		{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1 },
		{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1 },
		{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1 },
		{ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 } };

	for (int i = 0; i < MAP_SIZE_Y; i++)
	{
		for (int j = 0; j < MAP_SIZE_X; j++)
		{
			//マップを初期化
			_LandMap[i][j] = landMap[i][j];
		}
	}
	
	//MapDataオブジェクトを生成する
	this->_MapData = make_shared<MapData>(Vector3(0.0f, 0.0f, 0.0f));
	//MapDataオブジェクトを初期化する
	this->_MapData->Initialize();

	//MapDataオブジェクトを生成する
	
}

void Map::Update()
{
	Calc();
}

void Map::Calc()
{

}

void Map::Draw()
{

}

void Map::Finalize()
{

}
